rubyrails/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "message" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["message", " hello"], ["updated_at", "2015-08-05 09:44:04.448373"], ["id", 2]]